[Killed] ObjectLiteral
main/components/Articles/ArticleTable.jsx:38:5
   };
 
   const columns = [
-    {
-      header: "Id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
+    {},
 
     {
killedBy: ArticleTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:40:20
   const columns = [
     {
       header: "Id",
-      accessorKey: "id", // accessor is the "key" in the data
+      accessorKey: "", // accessor is the "key" in the data
     },
 
killedBy: ArticleTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"
